# Задайте список из n чисел последовательности (1 + 1/n)^n.
# Вывести в консоль сам список и сумму его элементов.
n = int(input('Ввелдите число '))
new_list = [0]*n
for i in new_list:
    new_list.append()
print(new_list)